#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/kstruempf/independo-workspace/runs/run-5q5btSxFNnbX7fp3

Waiting for the plan to start...

Terraform v1.4.0
on linux_amd64
Initializing plugins and modules...
data.google_iam_policy.noauth: Refreshing...
google_compute_network.vpc: Refreshing state... [id=projects/independo/global/networks/independo-prod-vpc]
google_container_registry.registry: Refreshing state... [id=eu.artifacts.independo.appspot.com]
data.google_iam_policy.noauth: Refresh complete after 0s [id=3450855414]
google_compute_firewall.allow_http: Refreshing state... [id=projects/independo/global/firewalls/independo-prod-fw-allow-http]
google_compute_global_address.private_ip_block: Refreshing state... [id=projects/independo/global/addresses/private-ip-block]
google_vpc_access_connector.connector: Refreshing state... [id=projects/independo/locations/europe-west1/connectors/vpc-con]
google_compute_firewall.allow_https: Refreshing state... [id=projects/independo/global/firewalls/independo-prod-fw-allow-https]
google_service_networking_connection.private_vpc_connection: Refreshing state... [id=https%3A%2F%2Fwww.googleapis.com%2Fcompute%2Fv1%2Fprojects%2Findependo%2Fglobal%2Fnetworks%2Findependo-prod-vpc:servicenetworking.googleapis.com]
google_cloud_run_service.independo_adminer: Refreshing state... [id=locations/europe-west1/namespaces/independo/services/independo-prod-adminer]
google_sql_database_instance.main: Refreshing state... [id=independo-db]
google_sql_database.independo_database: Refreshing state... [id=projects/independo/instances/independo-db/databases/independo_database]
google_sql_user.independouser: Refreshing state... [id=independouser//independo-db]
google_cloud_run_service_iam_policy.no_auth_adminer: Refreshing state... [id=v1/projects/independo/locations/europe-west1/services/independo-prod-adminer]
google_cloud_run_domain_mapping.domain_mapping_adminer: Refreshing state... [id=locations/europe-west1/namespaces/independo/domainmappings/adminer.independo.app]
google_cloud_run_service.independo_api: Refreshing state... [id=locations/europe-west1/namespaces/independo/services/independo-prod-api]
google_cloud_run_service_iam_policy.no_auth_api: Refreshing state... [id=v1/projects/independo/locations/europe-west1/services/independo-prod-api]
google_cloud_run_domain_mapping.domain_mapping_api: Refreshing state... [id=locations/europe-west1/namespaces/independo/domainmappings/api.independo.app]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_domain_mapping.domain_mapping_web_app will be created
  + resource "google_cloud_run_domain_mapping" "domain_mapping_web_app" {
      + id       = (known after apply)
      + location = "europe-west1"
      + name     = "web.independo.app"
      + project  = (known after apply)
      + status   = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + labels           = (known after apply)
          + namespace        = "independo"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + certificate_mode = "AUTOMATIC"
          + route_name       = "independo-prod-app"
        }
    }

  # google_cloud_run_service.independo_api will be updated in-place
  ~ resource "google_cloud_run_service" "independo_api" {
        id                         = "locations/europe-west1/namespaces/independo/services/independo-prod-api"
        name                       = "independo-prod-api"
        # (4 unchanged attributes hidden)

      ~ template {
          ~ spec {
                # (3 unchanged attributes hidden)

              ~ containers {
                  ~ image   = "eu.gcr.io/independo/independo-api:1.3.0" -> "eu.gcr.io/independo/independo-api:"
                    # (2 unchanged attributes hidden)

                    # (2 unchanged blocks hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # google_cloud_run_service.independo_web_app will be created
  + resource "google_cloud_run_service" "independo_web_app" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west1"
      + name                       = "independo-prod-app"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "autoscaling.knative.dev/maxScale"        = "1"
                  + "run.googleapis.com/vpc-access-connector" = "vpc-con"
                  + "run.googleapis.com/vpc-access-egress"    = "all-traffic"
                }
              + generation       = (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "eu.gcr.io/independo/independo-app:"

                  + ports {
                      + container_port = 80
                      + name           = (known after apply)
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1000m"
                          + "memory" = "1G"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```
</details>
*Pushed by: @dependabot[bot], Action: `pull_request`*